import pandas as pd
print(pd.__version__)   #1.5.3

data = [
    ["삼성", "1000", "2000"],
    ["현대", "1100", "3000"],
    ["LG", "2000", "500"],
    ["아모레", "3500", "6000"],
    ["네이버", "100", "1500"],
]

index = ['031', '059', '033', '045','023']
columns = ['종목명', '시가', '종가']

df = pd.DataFrame(data=data, index=index, columns=columns)

print(df)
#      종목명    시가    종가
# 031   삼성  1000  2000     
# 059   현대  1100  3000
# 033   LG  2000   500
# 045  아모레  3500  6000
# 023  네이버   100  1500
print("=======================================================")

print("시가가 1100원 이상인 행을 모두 출력")
aaa = df['시가'] >= '1100'
print(aaa)

print(df[aaa])

print(df.loc[aaa])

# print(df.iloc[aaa])     # 에러

#### 1100원 이상인 놈만 뽑아서 새로 df2를 만들거야.
### 이 방식을 여러분은 제일 많이 쓸거야!!! ###
df2 = pd.DataFrame()
df2 = df[df['시가'] >= '1100']  
print(df2)
# 059   현대  1100  3000
# 033   LG  2000   500
# 045  아모레  3500  6000

##################### 위에서 '종가' 컬러만 뽑고 싶으면? #####################
# print(df2['종가'])


print('##################### 위에서 종가 컬러만 뽑고 싶으면? #####################')

df3 = df[df['시가'] >= '1100']['종가']      ###### 아주 중요!! 꼭 기억하기 ######   조건 설정하고 또 '종가'열만 출력
print(df3)


df4 = df.loc[df['시가'] >= '1100']['종가']
print(df4)      # df3 = df4  loc 해도 똑같다.

#############################################################

# df5 = df[df['시가'] >= '1100' , '종가']
# print(df5)      # 에러

df6 = df.loc[df['시가'] >= '1100' , '종가']
print(df6)